exp_3_node/logs/lr_24_app3_25rps_wrk.log
Running 30s test @ http://10.106.139.161/?loopCount=25&base=6&exp=6
  1 threads and 1 connections

  Thread calibration: mean lat.: 1228.190ms, rate sampling interval: 5062ms

-----------------------------------------------------------------------
Test Results @ http://10.106.139.161/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.28s     3.81s   15.26s    80.90%
    Req/Sec     9.67      5.19    17.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.46s 
 75.000%    8.95s 
 90.000%   12.42s 
 99.000%   15.26s 
 99.900%   15.58s 
 99.990%   15.58s 
 99.999%   15.58s 
100.000%   15.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2717.695     0.000000            1         1.00
    2893.823     0.100000           18         1.11
    2936.831     0.200000           36         1.25
    3137.535     0.300000           54         1.43
    3381.247     0.400000           72         1.67
    4460.543     0.500000           89         2.00
    5394.431     0.550000           98         2.22
    6643.711     0.600000          107         2.50
    7389.183     0.650000          116         2.86
    8208.383     0.700000          125         3.33
    8945.663     0.750000          134         4.00
    9388.031     0.775000          138         4.44
    9789.439     0.800000          143         5.00
   10428.415     0.825000          147         5.71
   11034.623     0.850000          152         6.67
   11771.903     0.875000          156         8.00
   12099.583     0.887500          158         8.89
   12574.719     0.900000          161        10.00
   12894.207     0.912500          163        11.43
   13230.079     0.925000          165        13.33
   13451.263     0.937500          167        16.00
   13598.719     0.943750          168        17.78
   14000.127     0.950000          170        20.00
   14360.575     0.956250          171        22.86
   14532.607     0.962500          172        26.67
   14680.063     0.968750          173        32.00
   14680.063     0.971875          173        35.56
   14950.399     0.975000          174        40.00
   15106.047     0.978125          175        45.71
   15106.047     0.981250          175        53.33
   15261.695     0.984375          176        64.00
   15261.695     0.985938          176        71.11
   15261.695     0.987500          176        80.00
   15433.727     0.989062          177        91.43
   15433.727     0.990625          177       106.67
   15433.727     0.992188          177       128.00
   15433.727     0.992969          177       142.22
   15433.727     0.993750          177       160.00
   15581.183     0.994531          178       182.86
   15581.183     1.000000          178          inf
#[Mean    =     6282.700, StdDeviation   =     3805.814]
#[Max     =    15572.992, Total count    =          178]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  360 requests in 30.01s, 108.10KB read
  Non-2xx or 3xx responses: 18
Requests/sec:     12.00  
Transfer/sec:      3.60KB