exp_3_node/logs/lr_9_app1_75rps_wrk.log
Running 30s test @ http://10.106.139.161/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 1587.869ms, rate sampling interval: 6455ms
  Thread calibration: mean lat.: 1601.050ms, rate sampling interval: 5189ms
  Thread calibration: mean lat.: 1416.728ms, rate sampling interval: 4775ms
  Thread calibration: mean lat.: 1772.391ms, rate sampling interval: 6471ms
  Thread calibration: mean lat.: 1894.456ms, rate sampling interval: 5836ms

-----------------------------------------------------------------------
Test Results @ http://10.106.139.161/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.37s     1.80s    9.67s    59.71%
    Req/Sec     9.81      0.73    11.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.37s 
 75.000%    7.94s 
 90.000%    8.76s 
 99.000%    9.67s 
 99.900%   10.08s 
 99.990%   10.11s 
 99.999%   10.11s 
100.000%   10.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2795.519     0.000000            1         1.00
    3958.783     0.100000          104         1.11
    4530.175     0.200000          208         1.25
    5197.823     0.300000          312         1.43
    5840.895     0.400000          416         1.67
    6365.183     0.500000          520         2.00
    6787.071     0.550000          572         2.22
    7106.559     0.600000          624         2.50
    7307.263     0.650000          676         2.86
    7602.175     0.700000          729         3.33
    7942.143     0.750000          782         4.00
    8036.351     0.775000          807         4.44
    8175.615     0.800000          833         5.00
    8327.167     0.825000          858         5.71
    8445.951     0.850000          887         6.67
    8560.639     0.875000          910         8.00
    8642.559     0.887500          924         8.89
    8757.247     0.900000          937        10.00
    8839.167     0.912500          949        11.43
    8896.511     0.925000          963        13.33
    8994.815     0.937500          975        16.00
    9027.583     0.943750          982        17.78
    9076.735     0.950000          988        20.00
    9142.271     0.956250          996        22.86
    9207.807     0.962500         1002        26.67
    9371.647     0.968750         1008        32.00
    9404.415     0.971875         1011        35.56
    9502.719     0.975000         1014        40.00
    9543.679     0.978125         1020        45.71
    9551.871     0.981250         1021        53.33
    9592.831     0.984375         1024        64.00
    9625.599     0.985938         1026        71.11
    9650.175     0.987500         1028        80.00
    9658.367     0.989062         1029        91.43
    9707.519     0.990625         1031       106.67
    9756.671     0.992188         1032       128.00
    9854.975     0.992969         1033       142.22
    9879.551     0.993750         1035       160.00
    9879.551     0.994531         1035       182.86
    9920.511     0.995313         1036       213.33
    9920.511     0.996094         1036       256.00
    9953.279     0.996484         1037       284.44
    9953.279     0.996875         1037       320.00
    9994.239     0.997266         1038       365.71
    9994.239     0.997656         1038       426.67
    9994.239     0.998047         1038       512.00
   10076.159     0.998242         1039       568.89
   10076.159     0.998437         1039       640.00
   10076.159     0.998633         1039       731.43
   10076.159     0.998828         1039       853.33
   10076.159     0.999023         1039      1024.00
   10108.927     0.999121         1040      1137.78
   10108.927     1.000000         1040          inf
#[Mean    =     6371.184, StdDeviation   =     1803.982]
#[Max     =    10100.736, Total count    =         1040]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1543 requests in 30.00s, 470.76KB read
Requests/sec:     51.43  
Transfer/sec:     15.69KB