exp_3_node/logs/mplb_12_app2_50rps_wrk.log
Running 30s test @ http://10.106.139.161/?loopCount=25&base=6&exp=6
  5 threads and 5 connections

  Thread calibration: mean lat.: 53.402ms, rate sampling interval: 161ms
  Thread calibration: mean lat.: 63.766ms, rate sampling interval: 171ms
  Thread calibration: mean lat.: 48.356ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 49.896ms, rate sampling interval: 139ms
  Thread calibration: mean lat.: 59.975ms, rate sampling interval: 183ms

-----------------------------------------------------------------------
Test Results @ http://10.106.139.161/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    45.46ms   14.80ms 108.61ms   89.20%
    Req/Sec     9.56      3.11    14.00     73.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   41.53ms
 75.000%   42.56ms
 90.000%   53.53ms
 99.000%  108.61ms
 99.900%  145.92ms
 99.990%  168.70ms
 99.999%  168.70ms
100.000%  168.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.319     0.000000            1         1.00
      40.223     0.100000          100         1.11
      40.703     0.200000          211         1.25
      41.023     0.300000          314         1.43
      41.247     0.400000          400         1.67
      41.535     0.500000          505         2.00
      41.695     0.550000          552         2.22
      41.855     0.600000          601         2.50
      42.047     0.650000          653         2.86
      42.239     0.700000          702         3.33
      42.559     0.750000          752         4.00
      42.687     0.775000          777         4.44
      42.815     0.800000          801         5.00
      43.007     0.825000          827         5.71
      43.295     0.850000          853         6.67
      43.647     0.875000          876         8.00
      47.263     0.887500          888         8.89
      53.535     0.900000          900        10.00
      65.023     0.912500          913        11.43
      69.439     0.925000          925        13.33
      72.575     0.937500          938        16.00
      78.783     0.943750          944        17.78
      80.511     0.950000          951        20.00
      81.727     0.956250          958        22.86
      82.111     0.962500          963        26.67
      82.495     0.968750          969        32.00
      84.863     0.971875          972        35.56
      88.127     0.975000          975        40.00
      90.175     0.978125          979        45.71
      91.839     0.981250          982        53.33
      94.911     0.984375          985        64.00
      98.431     0.985938          986        71.11
     101.247     0.987500          988        80.00
     108.607     0.989062          990        91.43
     133.759     0.990625          991       106.67
     137.343     0.992188          993       128.00
     137.343     0.992969          993       142.22
     137.471     0.993750          994       160.00
     137.983     0.994531          995       182.86
     140.671     0.995313          996       213.33
     140.799     0.996094          997       256.00
     140.799     0.996484          997       284.44
     140.799     0.996875          997       320.00
     145.407     0.997266          998       365.71
     145.407     0.997656          998       426.67
     145.919     0.998047          999       512.00
     145.919     0.998242          999       568.89
     145.919     0.998437          999       640.00
     145.919     0.998633          999       731.43
     145.919     0.998828          999       853.33
     168.703     0.999023         1000      1024.00
     168.703     1.000000         1000          inf
#[Mean    =       45.459, StdDeviation   =       14.803]
#[Max     =      168.576, Total count    =         1000]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  1495 requests in 30.00s, 455.54KB read
Requests/sec:     49.83  
Transfer/sec:     15.18KB