exp_3_node/logs/mplb_18_app3_25rps_wrk.log
Running 30s test @ http://10.106.139.161/?loopCount=25&base=6&exp=6
  1 threads and 1 connections

  Thread calibration: mean lat.: 2131.377ms, rate sampling interval: 6664ms

-----------------------------------------------------------------------
Test Results @ http://10.106.139.161/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.57s     1.82s    9.84s    59.18%
    Req/Sec    16.67      0.94    18.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.68s 
 75.000%    8.11s 
 90.000%    8.88s 
 99.000%    9.84s 
 99.900%   10.00s 
 99.990%   10.00s 
 99.999%   10.00s 
100.000%   10.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3770.367     0.000000            2         1.00
    4110.335     0.100000           36         1.11
    4550.655     0.200000           75         1.25
    5222.399     0.300000          103         1.43
    5775.359     0.400000          143         1.67
    6684.671     0.500000          172         2.00
    7053.311     0.550000          189         2.22
    7565.311     0.600000          206         2.50
    7643.135     0.650000          224         2.86
    8011.775     0.700000          241         3.33
    8114.175     0.750000          258         4.00
    8138.751     0.775000          268         4.44
    8216.575     0.800000          275         5.00
    8278.015     0.825000          285         5.71
    8429.567     0.850000          292         6.67
    8716.287     0.875000          301         8.00
    8724.479     0.887500          305         8.89
    8880.127     0.900000          309        10.00
    9011.199     0.912500          313        11.43
    9273.343     0.925000          318        13.33
    9519.103     0.937500          322        16.00
    9641.983     0.943750          325        17.78
    9666.559     0.950000          327        20.00
    9674.751     0.956250          329        22.86
    9707.519     0.962500          337        26.67
    9707.519     0.968750          337        32.00
    9707.519     0.971875          337        35.56
    9707.519     0.975000          337        40.00
    9707.519     0.978125          337        45.71
    9707.519     0.981250          337        53.33
    9723.903     0.984375          338        64.00
    9756.671     0.985938          339        71.11
    9756.671     0.987500          339        80.00
    9838.591     0.989062          340        91.43
    9838.591     0.990625          340       106.67
    9961.471     0.992188          342       128.00
    9961.471     0.992969          342       142.22
    9961.471     0.993750          342       160.00
    9961.471     0.994531          342       182.86
    9961.471     0.995313          342       213.33
    9961.471     0.996094          342       256.00
    9961.471     0.996484          342       284.44
    9961.471     0.996875          342       320.00
   10002.431     0.997266          343       365.71
   10002.431     1.000000          343          inf
#[Mean    =     6573.617, StdDeviation   =     1822.837]
#[Max     =     9994.240, Total count    =          343]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  499 requests in 30.00s, 152.08KB read
Requests/sec:     16.63  
Transfer/sec:      5.07KB